Tutorial/2022-05-17-053529-how_to_package_nim.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>how to package nim</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">how to package nim</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org289a79a">nimble2nix</a></li>
<li><a href="#orgf14bbb4">Using nix</a></li>
<li><a href="#org05db54c">using flakes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org289a79a" class="outline-2">
<h2 id="org289a79a">nimble2nix</h2>
<div class="outline-text-2" id="text-org289a79a">
<p>
Painless Nimble deps
<a href="https://github.com/bandithedoge/nimble2nix">https://github.com/bandithedoge/nimble2nix</a>
<code>nix-env -iA nixpkgs.fetchgit --arg url "https://github.com/bandithedoge/nimble2nix"
nimble2nix .</code>
</p>
</div>
</div>

<div id="outline-container-orgf14bbb4" class="outline-2">
<h2 id="orgf14bbb4">Using nix</h2>
<div class="outline-text-2" id="text-orgf14bbb4">
<p>
here is an example package i made for counting puffs
pkgs/puffer/defualt.nix
</p>
<div class="org-src-container">
<pre class="src src-nix">{ lib, stdenv, nimPackages, fetchurl }:

<span style="color: #ff2afc; font-weight: bold;">let</span>
  <span style="color: #df85ff;">cligen</span> = nimPackages.buildNimPackage <span style="color: #ff2afc; font-weight: bold;">rec</span> {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"cligen"</span>;
    <span style="color: #df85ff;">version</span> = <span style="color: #7984D1;">"1.5.23"</span>;
    <span style="color: #df85ff;">src</span> = fetchurl {
    <span style="color: #df85ff;">url</span> = <span style="color: #7984D1;">"https://github.com/c-blake/cligen/archive/refs/tags/v</span><span style="color: #ff2afc; font-weight: bold;">${</span>version<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">.tar.gz"</span>;
    <span style="color: #df85ff;">sha256</span> = <span style="color: #7984D1;">"sha256-Qg3+yrvsItEEhSfDVY9t+5CHj1fSJTpYokWPQObgH0g="</span>;

  };


  };
<span style="color: #df85ff;">puffer</span> = nimPackages.buildNimPackage <span style="color: #ff2afc; font-weight: bold;">rec</span> {
  <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"puffer"</span>;
  <span style="color: #df85ff;">rev</span> = <span style="color: #7984D1;">"d0c7d6a9a9e48e31eb24807f8a24118bc19c031c"</span>;

  <span style="color: #df85ff;">nimBinOnly</span> = <span style="color: #1ea8fc;">true</span>;

  <span style="color: #df85ff;">src</span> = fetchurl {
    <span style="color: #df85ff;">url</span> = <span style="color: #7984D1;">"https://github.com/lost-rob0t/puffer.nim/archive/</span><span style="color: #ff2afc; font-weight: bold;">${</span>rev<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">.tar.gz"</span>;
    <span style="color: #df85ff;">sha256</span> = <span style="color: #7984D1;">"sha256-hAqlBGiOQk9QVbtDhNHpk5Z7EtyeW02hRlYMxbvb++Q="</span>;
  };
  <span style="color: #df85ff;">buildInputs</span> = <span style="color: #ff2afc; font-weight: bold;">with</span> nimPackages; [
    cligen
  ];
};

<span style="color: #ff2afc; font-weight: bold;">in</span>
  stdenv.mkDerivation <span style="color: #ff2afc; font-weight: bold;">rec</span> {
    <span style="color: #df85ff;">pname</span> = <span style="color: #7984D1;">"puffer"</span>;
    <span style="color: #df85ff;">buildInputs</span> = [ puffer ];
    <span style="color: #df85ff;">meta</span> = <span style="color: #ff2afc; font-weight: bold;">with</span> lib; {
    <span style="color: #df85ff;">description</span> = <span style="color: #7984D1;">"count puffs"</span>;
    <span style="color: #df85ff;">homepage</span> = <span style="color: #7984D1;">"https://github.com/lost-rob0t/puffer.ni,"</span>;
    <span style="color: #df85ff;">license</span> = licenses.mit;
    <span style="color: #df85ff;">maintainers</span> = [ <span style="color: #7984D1;">"nsaspy"</span> ];
    };
  }

</pre>
</div>
</div>
</div>

<div id="outline-container-org05db54c" class="outline-2">
<h2 id="org05db54c">using flakes</h2>
<div class="outline-text-2" id="text-org05db54c">
<ul class="org-ul">
<li><a href="2022-05-16-045822-nim_flake_example.html#ID-62bf048c-8b3b-4356-a939-ac7132bfaae2">nim-flake-example</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>